app/views/restaurants/index.html.haml

SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."review_id" = $1  [["review_id", 2]]
---
            = link_to "Endorse Review", review_endorsements_path(review), method: :post
            %p= pluralize review.endorsements.count, 'endorsement'