app/controllers/endorsements_controller.rb

  def create
    @review = Review.find(params[:review_id])
    @review.endorsements.create
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "endorsements" ("review_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["review_id", 2], ["created_at", "2015-09-04 17:07:52.508495"], ["updated_at", "2015-09-04 17:07:52.508495"]]