app/controllers/restaurants_controller.rb

  def create
    @user = User.find(current_user.id)
    @restaurant = @user.restaurants.create(restaurant_params)
---
INSERT INTO "restaurants" ("name", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"