app/controllers/reviews_controller.rb

  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.build_review(review_params, current_user)
    if @review.save
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "reviews" ("thoughts", "rating", "user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "so so"], ["rating", 3], ["user_id", 18], ["restaurant_id", 18], ["created_at", "2015-09-04 10:17:06.665963"], ["updated_at", "2015-09-04 10:17:06.665963"]]

  def destroy
    @review = Review.find(params[:id])
    if current_user.has_reviewed_this_restaurant?(@review)
      @review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 11]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 11]]